Environment: prod. Pipeline Stage: prod
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm02"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm03"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm04"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwctestdm01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_network_interface.NIC["vmxwcdm04"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcdm04"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.33"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwcdm01"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcdm01"
      + network_interface_ids            = [
          + "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcdm01",
        ]
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold1"
        }
      + vm_size                          = "Standard_D8s_V4"
      + zones                            = [
          + "1",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "data-vmxwcdm01"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "os-vmxwcdm01"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwcdm02"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcdm02"
      + network_interface_ids            = [
          + "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcdm02",
        ]
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold1"
        }
      + vm_size                          = "Standard_D8s_V4"
      + zones                            = [
          + "2",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "data-vmxwcdm02"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "os-vmxwcdm02"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwcdm03"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcdm03"
      + network_interface_ids            = [
          + "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwcdm03",
        ]
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold1"
        }
      + vm_size                          = "Standard_D8s_V4"
      + zones                            = [
          + "3",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "data-vmxwcdm03"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "os-vmxwcdm03"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwcdm04"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcdm04"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold1"
        }
      + vm_size                          = "Standard_D8s_V4"
      + zones                            = [
          + "1",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "data-vmxwcdm04"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "os-vmxwcdm04"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwctestdm01"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwctestdm01"
      + network_interface_ids            = [
          + "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/networkInterfaces/nic1-vmxwctestdm01",
        ]
      + resource_group_name              = "rg-xwc-core-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "test"
        }
      + vm_size                          = "Standard_B4ms"
      + zones                            = [
          + "1",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "data-vmxwctestdm01"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "os-vmxwctestdm01"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwcdm01"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwcdm02"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwcdm03"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwcdm04"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwctestdm01"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "IaaSAntimalware"
      + publisher                  = "Microsoft.Azure.Security"
      + settings                   = jsonencode(
            {
              + AntimalwareEnabled        = true
              + Exclusions                = {
                  + Extensions = ""
                  + Paths      = "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database"
                  + Processes  = "NTUser.dat*"
                }
              + RealtimeProtectionEnabled = "true"
              + ScheduledScanSettings     = {
                  + day       = "7"
                  + isEnabled = "true"
                  + scanType  = "Quick"
                  + time      = "120"
                }
            }
        )
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "IaaSAntimalware"
      + type_handler_version       = "1.1"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.OMSAGENT["vmxwcdm01"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.OMSAGENT["vmxwcdm02"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.OMSAGENT["vmxwcdm03"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.OMSAGENT["vmxwcdm04"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.OMSAGENT["vmxwctestdm01"] will be created
  + resource "azurerm_virtual_machine_extension" "OMSAGENT" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "MicrosoftMonitoringAgent"
      + protected_settings         = (sensitive value)
      + publisher                  = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                   = (known after apply)
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "MicrosoftMonitoringAgent"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwcdm01"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwcdm02"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwcdm03"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwcdm04"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwctestdm01"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version = true
      + id                         = (known after apply)
      + name                       = "AADLoginForWindows"
      + publisher                  = "Microsoft.Azure.ActiveDirectory"
      + tags                       = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                       = "AADLoginForWindows"
      + type_handler_version       = "1.0"
      + virtual_machine_id         = (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.